app/Http/Controllers/AdminController.php

    public function show($id)
    {
        $data = array(
            'user' => User::join('offices', 'offices.office_id', '=', 'users.office_id')
                            ->join('towns', 'towns.town_id', '=', 'offices.town_id')
                            ->where('users.id', $id)
                            ->first(),
        );
---
select * from `users` inner join `offices` on `offices`.`office_id` = `users`.`office_id` inner join `towns` on `towns`.`town_id` = `offices`.`town_id` where `users`.`id` = '1' limit 1

    public function Users(Request $request)
    {
        $data = array(
            'user' => User::join('offices', 'offices.office_id', '=', 'users.office_id')
                            ->get(),
            'office' => Office::all(),
        );
---
select * from `offices`
select * from `users` inner join `offices` on `offices`.`office_id` = `users`.`office_id`

    public function Office(Request $request, $action = null)
    {
        if ($action == null) {
            $data = array(
                'office' => Office::join('towns', 'towns.town_id', '=', 'offices.town_id')->get(),
                'town' => Town::all(),
            );
---
select * from `offices` inner join `towns` on `towns`.`town_id` = `offices`.`town_id`
select * from `towns`

    public function userRegion()
    {
        $label = [];
        $data = [];

        $town = Town::all();
        foreach ($town as $t ) {
            array_push($label, $t['town_slug'].' '.$t['town_name']);
            array_push($data, User::join('offices', 'offices.office_id', '=', 'users.office_id')->where('town_id', $t['town_id'])->count());
---
select * from `towns`
select count(*) as aggregate from `users` inner join `offices` on `offices`.`office_id` = `users`.`office_id` where `town_id` = 1

    public function education(Request $request, $action = null)
    {
        if ($action == null) {
            $data = array(
                'education' => Education::all(),
            );
            return view('admin.education', $data);
        } else if ($action == 'add'){
            $edu = new Education;
            try {
                $edu->education_id = $request['education_id'];
                $edu->education_name = Str::upper($request['education_name']);
                $edu-> save();
            } catch (\Throwable $th) {
                return redirect()->route('admin.education')->with('message', 'Cannot Add Education Field!');
            }

            return redirect()->route('admin.education')->with('message', 'Add Education Field Successful!');
        } else if ($action == 'delete'){
            $edu = Education::find($this->check($request['education_id']));
            $edu->delete();

            return redirect()->route('admin.education')->with('message', 'Delete Education Field Successful!');
---
select * from `educations`

    public function jobPosition(Request $request, $action = null)
    {
        if ($action == null) {
            $data = array(
                'jobPosition' => JobPosition::all(),
            );
---
select * from `positions`