app/Http/Controllers/AdminController.php

    public function Position(Request $request, $type = false)
    {
        if (!$type) {
            $data = array(
                'position' => Position::all(),
            );
---
select * from "positions"