app/Http/Controllers/DinasController.php

select * from `ipk1s` inner join `ipk1_names` on `ipk1_names`.`ipk1_name_id` = `ipk1s`.`ipk1_name_id` where `ipk1_month` = '2021-05' group by `ipk1s`.`ipk1_name_id`
---
    public function ipk1(Request $request)
    {
        if ($request['month'] == null) {
            $request['month'] = date('Y-m');
        }
        $data = array(
            'ipk' => IPK1::join('ipk1_names', 'ipk1_names.ipk1_name_id', '=', 'ipk1s.ipk1_name_id')
                            ->where('ipk1_month', $request['month'])
                            ->groupBy('ipk1s.ipk1_name_id')
                            ->get(),
            'month' => $request['month'],
        );

select * from `ipk2s` inner join `educations` on `educations`.`education_id` = `ipk2s`.`education_id` where `ipk2_month` = '2021-05' group by `ipk2s`.`education_id`
---
    public function ipk2(Request $request)
    {
        if ($request['month'] == null) {
            $request['month'] = date('Y-m');
        }
        $data = array(
            'ipk' => IPK2::join('educations', 'educations.education_id', '=', 'ipk2s.education_id')
                            ->where('ipk2_month', $request['month'])
                            ->groupBy('ipk2s.education_id')
                            ->get(),
            'month' => $request['month'],
        );

select * from `ipk6s` inner join `business_fields` on `business_fields`.`business_field_id` = `ipk6s`.`business_field_id` where `ipk6_month` = '2021-05' group by `ipk6s`.`business_field_id`
---
    public function ipk6(Request $request, $action = null)
    {
        if ($request['month'] == null) {
            $request['month'] = date('Y-m');
        }
        $data = array(
            'ipk' => IPK6::join('business_fields', 'business_fields.business_field_id', '=', 'ipk6s.business_field_id')
                            ->where('ipk6_month', $request['month'])
                            ->groupBy('ipk6s.business_field_id')
                            ->get(),
            'month' => $request['month'],
        );