app/Http/Controllers/UserController.php

    public function print(Request $request)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($request['jenisCetak'] == 'excel') {
            if ($request['type'] == 'ipk1') {
                return Excel::download(new IPK1Export($town->town_id, $request['month']), 'ipk1-'.$request['month'].'.xlsx');
            }
        } else {
            if ($request['type'] == 'ipk1') {
                $data = array(
                    'ipk' => IPK1::join('ipk1_names', 'ipk1_names.ipk1_name_id', '=', 'ipk1s.ipk1_name_id')
                                    ->where('ipk1_month', $request['month'])
                                    ->where('town_id', $town['town_id'])
                                    ->get(),
                    'month' => $request['month'],
                );
---
select * from `ipk1s` inner join `ipk1_names` on `ipk1_names`.`ipk1_name_id` = `ipk1s`.`ipk1_name_id` where `ipk1_month` = '2021-05' and `town_id` = 1