app/Http/Controllers/UserController.php

    public function store(Request $request)
    {
        $office = Office::where('office_name', $request['office_id'])->first();
        $position = Position::where('position_name', $request['position_id'])->first();
---
select * from "offices" where "office_name" = 'Disnakertrans Bukittinggi' limit 1
select * from "positions" where "position_name" = 'kepegawaian' limit 1

    public function ipk1(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK1::join('ipk1_names', 'ipk1_names.ipk1_name_id', '=', 'ipk1s.ipk1_name_id')
                                ->where('ipk1_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
            return view('laporan.ipk1', $data);
        } else if ($action == 'edit') {
            $ipk = IPK1::find($request['ipk1_id']);

            $ipk['15-19l'] = $request['15-19l'];
            $ipk['15-19p'] = $request['15-19p'];
            $ipk['20-29l'] = $request['20-29l'];
            $ipk['20-29p'] = $request['20-29p'];
            $ipk['30-44l'] = $request['30-44l'];
            $ipk['30-44p'] = $request['30-44p'];
            $ipk['45-54l'] = $request['45-54l'];
            $ipk['45-54p'] = $request['45-54p'];
            $ipk['55l'] = $request['55l'];
            $ipk['55p'] = $request['55p'];
            $ipk->save();
---
select * from `ipk1s` inner join `ipk1_names` on `ipk1_names`.`ipk1_name_id` = `ipk1s`.`ipk1_name_id` where `ipk1_month` = '2021-05' and `town_id` = 2
select * from `ipk1s` where `ipk1_month` = '2021-01' limit 1
update `ipk1s` set `15-19l` = '01', `15-19p` = '1', `20-29l` = '1', `20-29p` = '1', `30-44l` = '1', `30-44p` = '1', `45-54l` = '1', `45-54p` = '1', `55l` = '1', `55p` = '1', `ipk1s`.`updated_at` = '2021-05-24 04:27:10' where `ipk1_id` = 1

    public function ipk2(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK2::join('educations', 'educations.education_id', '=', 'ipk2s.education_id')
                                ->where('ipk2_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
            return view('laporan.ipk2', $data);
        } else if ($action == 'edit') {
            $ipk = IPK2::find($request['ipk2_id']);
---
select * from `ipk2s` inner join `educations` on `educations`.`education_id` = `ipk2s`.`education_id` where `ipk2_month` = '2021-05' and `town_id` = 2
select * from `ipk2s` where `ipk2_month` = '2021-05' limit 1

    public function ipk3(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK3::join('job_positions', 'job_positions.job_position_id', '=', 'ipk3s.job_position_id')
                                ->where('ipk3_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
            return view('laporan.ipk3', $data);
        } else if ($action == 'edit') {
            $ipk = IPK3::find($request['ipk3_id']);
            $ipk->rest_last_month_l = $request['rest_last_month_l'];
            $ipk->rest_last_month_p = $request['rest_last_month_p'];
            $ipk->registered_this_month_l = $request['registered_this_month_l'];
            $ipk->registered_this_month_p = $request['registered_this_month_p'];
            $ipk->placement_this_month_l = $request['placement_this_month_l'];
            $ipk->placement_this_month_p = $request['placement_this_month_p'];
            $ipk->deleted_this_month_l = $request['deleted_this_month_l'];
            $ipk->deleted_this_month_p = $request['deleted_this_month_p'];
            $ipk->rest_this_month_l = $request['rest_this_month_l'];
            $ipk->rest_this_month_p = $request['rest_this_month_p'];
            $ipk->save();
---
select * from `ipk3s` inner join `job_positions` on `job_positions`.`job_position_id` = `ipk3s`.`job_position_id` where `ipk3_month` = '2021-05' and `town_id` = 2
update `ipk3s` set `rest_last_month_l` = '03', `registered_this_month_l` = '3', `placement_this_month_l` = '3', `deleted_this_month_l` = '3', `rest_this_month_l` = '3', `rest_last_month_p` = '3', `registered_this_month_p` = '3', `placement_this_month_p` = '3', `deleted_this_month_p` = '3', `rest_this_month_p` = '3', `ipk3s`.`updated_at` = '2021-05-24 04:52:52' where `ipk3_id` = 9

    public function ipk4(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK4::join('educations', 'educations.education_id', '=', 'ipk4s.education_id')
                                ->where('ipk4_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
            return view('laporan.ipk4', $data);
        } else if ($action == 'edit') {
            $ipk = IPK4::find($request['ipk4_id']);
            $ipk->rest_last_month_l = $request['rest_last_month_l'];
            $ipk->rest_last_month_p = $request['rest_last_month_p'];
            $ipk->registered_this_month_l = $request['registered_this_month_l'];
            $ipk->registered_this_month_p = $request['registered_this_month_p'];
            $ipk->placement_this_month_l = $request['placement_this_month_l'];
            $ipk->placement_this_month_p = $request['placement_this_month_p'];
            $ipk->deleted_this_month_l = $request['deleted_this_month_l'];
            $ipk->deleted_this_month_p = $request['deleted_this_month_p'];
            $ipk->rest_this_month_l = $request['rest_this_month_l'];
            $ipk->rest_this_month_p = $request['rest_this_month_p'];
            $ipk->save();
---
select * from `ipk4s` inner join `educations` on `educations`.`education_id` = `ipk4s`.`education_id` where `ipk4_month` = '2021-05' and `town_id` = 1
update `ipk4s` set `rest_last_month_l` = '09', `registered_this_month_l` = '9', `placement_this_month_l` = '9', `deleted_this_month_l` = '9', `rest_this_month_l` = '9', `rest_last_month_p` = '9', `registered_this_month_p` = '9', `placement_this_month_p` = '9', `deleted_this_month_p` = '9', `rest_this_month_p` = '9', `ipk4s`.`updated_at` = '2021-05-19 08:48:49' where `ipk4_id` = 2

    public function ipk5(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK5::join('job_positions', 'job_positions.job_position_id', '=', 'ipk5s.job_position_id')
                                ->where('ipk5_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
            return view('laporan.ipk5', $data);
        } else if ($action == 'edit') {
            $ipk = IPK5::find($request['ipk5_id']);
            $ipk->rest_last_month_l = $request['rest_last_month_l'];
            $ipk->rest_last_month_p = $request['rest_last_month_p'];
            $ipk->registered_this_month_l = $request['registered_this_month_l'];
            $ipk->registered_this_month_p = $request['registered_this_month_p'];
            $ipk->placement_this_month_l = $request['placement_this_month_l'];
            $ipk->placement_this_month_p = $request['placement_this_month_p'];
            $ipk->deleted_this_month_l = $request['deleted_this_month_l'];
            $ipk->deleted_this_month_p = $request['deleted_this_month_p'];
            $ipk->rest_this_month_l = $request['rest_this_month_l'];
            $ipk->rest_this_month_p = $request['rest_this_month_p'];
            $ipk->save();
---
select * from `ipk5s` inner join `job_positions` on `job_positions`.`job_position_id` = `ipk5s`.`job_position_id` where `ipk5_month` = '2021-05' and `town_id` = 1
update `ipk5s` set `rest_last_month_l` = '01', `registered_this_month_l` = '1', `placement_this_month_l` = '1', `deleted_this_month_l` = '1', `rest_this_month_l` = '1', `rest_last_month_p` = '1', `registered_this_month_p` = '1', `placement_this_month_p` = '1', `deleted_this_month_p` = '1', `rest_this_month_p` = '1', `ipk5s`.`updated_at` = '2021-05-24 04:57:39' where `ipk5_id` = 6

    public function ipk6(Request $request, $action = null)
    {
        $office = Office::find(Auth::user()->office_id);
        $town = Town::find($office['town_id']);
        if ($action == null) {
            if ($request['month'] == null) {
                $request['month'] = date('Y-m');
            }
            $data = array(
                'ipk' => IPK6::join('business_fields', 'business_fields.business_field_id', '=', 'ipk6s.business_field_id')
                                ->where('ipk6_month', $request['month'])
                                ->where('town_id', $town['town_id'])
                                ->get(),
                'month' => $request['month'],
            );
---
select * from `ipk6s` inner join `business_fields` on `business_fields`.`business_field_id` = `ipk6s`.`business_field_id` where `ipk6_month` = '2021-05' and `town_id` = 1